In [5]:
# Merging, Joining and Concatenating
import pandas as pd
data = pd.DataFrame({'Park': ['A', 'A', 'B', 'B'],
'Name': ['Anna','Ben','chris','daisy'],
'Lemonades': [2, 3, 4, 5]
})
data2 = pd.DataFrame({'Store': ['X', 'Z', 'Y', 'Y'],
    'Employee': ['Ravi', 'Aman', 'Neha', 'Pooja'],
    'Sales': [120, 150, 200, 180]
})
pd.concat([data,data2],ignore_index=True)

  Park   Name  Lemonades Store Employee  Sales
0    A   Anna        2.0   NaN      NaN    NaN
1    A    Ben        3.0   NaN      NaN    NaN
2    B  chris        4.0   NaN      NaN    NaN
3    B  daisy        5.0   NaN      NaN    NaN
4  NaN    NaN        NaN     X     Ravi  120.0
5  NaN    NaN        NaN     Z     Aman  150.0
6  NaN    NaN        NaN     Y     Neha  200.0
7  NaN    NaN        NaN     Y    Pooja  180.0

In [ ]:
data.append(data2) # removed in pandas 2.0

In [7]:
# common column is required to merge them
data2 = pd.DataFrame({'Store': ['X', 'Z', 'Y', 'Y'],
    'Name': ['Anna','Ben','chris','daisy'],
    'Sales': [120, 150, 200, 180]
})
pd.merge(data,data2,on="Name")

  Park   Name  Lemonades Store  Sales
0    A   Anna          2     X    120
1    A    Ben          3     Z    150
2    B  chris          4     Y    200
3    B  daisy          5     Y    180

In [11]:
# Join on Index
data.join(data2.set_index("Name"),on="Name") # The right DataFrame must have that column as its index

  Park   Name  Lemonades Store  Sales
0    A   Anna          2     X    120
1    A    Ben          3     Z    150
2    B  chris          4     Y    200
3    B  daisy          5     Y    180

In [12]:
#  Working with Time Series
data3 = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04'],
    'Sales': [100, 150, 130, 170],
    'City': ['Indore', 'Bhopal', 'Indore', 'Bhopal']
})
data3

         Date  Sales    City
0  2024-01-01    100  Indore
1  2024-01-02    150  Bhopal
2  2024-01-03    130  Indore
3  2024-01-04    170  Bhopal

In [15]:
data3["Date"]=pd.to_datetime(data3["Date"])
data3

        Date  Sales    City
0 2024-01-01    100  Indore
1 2024-01-02    150  Bhopal
2 2024-01-03    130  Indore
3 2024-01-04    170  Bhopal

In [20]:
data4 = pd.DataFrame({
    'Date': [
        '2024-01-01', '2024-01-02', '2024-01-03',
        '2024-01-04', '2024-01-05', '2024-01-06',
        '2024-01-07'
    ],
    'Lemonades': [10, 15, 20, 18, 25, 30, 28]
})
data4["Date"]=pd.to_datetime(data4["Date"])
data4.set_index("Date",inplace=True)

In [21]:
data4.resample('W').sum()

            Lemonades
Date
2024-01-07        146

In [22]:
data4['Previous Lemonades'] = data4['Lemonades'].shift(4)
data4

            Lemonades  Previous Lemonades
Date
2024-01-01         10                 NaN
2024-01-02         15                 NaN
2024-01-03         20                 NaN
2024-01-04         18                 NaN
2024-01-05         25                10.0
2024-01-06         30                15.0
2024-01-07         28                20.0

In [25]:
data4['Rolling Average'] = data4['Lemonades'].rolling(window=3).mean()
data4

            Lemonades  Previous Lemonades  Rolling Average
Date
2024-01-01         10                 NaN              NaN
2024-01-02         15                 NaN              NaN
2024-01-03         20                 NaN        15.000000
2024-01-04         18                 NaN        17.666667
2024-01-05         25                10.0        21.000000
2024-01-06         30                15.0        24.333333
2024-01-07         28                20.0        27.666667